; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 856280 2 1 4 5 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image0 - mode
	thermograph2 - mode
	image1 - mode
	infrared3 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 image1)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Planet5 infrared3)
	(have_image Star6 thermograph2)
	(have_image Star7 image0)
	(have_image Star8 image0)
	(have_image Phenomenon9 image0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite1 planet5 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet5)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite1 groundstation3 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 6
6. (turn_to satellite0 star6 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star6)
   goals met: 1 of 6
7. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 1 of 6
8. (take_image satellite0 star6 instrument0 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 2 of 6
9. (turn_to satellite1 planet5 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet5)
   goals met: 2 of 6
10. (take_image satellite1 planet5 instrument1 infrared3)
   added: (have_image planet5 infrared3)
   goals met: 3 of 6
11. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 2 of 6
12. (take_image satellite0 star8 instrument0 image0)
   added: (have_image star8 image0)
   goals met: 3 of 6
13. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   goals met: 3 of 6
14. (take_image satellite0 star7 instrument0 image0)
   added: (have_image star7 image0)
   goals met: 4 of 6
15. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 5 of 6
16. (turn_to satellite0 phenomenon9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 6
17. (take_image satellite0 phenomenon9 instrument0 image0)
   added: (have_image phenomenon9 image0)
   goals met: 5 of 6
18. (turn_to satellite0 star6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star6)
   goals met: 6 of 6
